#ifndef __QUIZ_H__
#define __QUIZ_H__
char *q_dif[] = {
    "다음 중 의도적으로 자녀를 두지 않는 맞벌이 부부를 뜻하는 것은?\n1. 딘트족\n2. 딩크족\n3. 니트족\n4. 듀크족\n", 
    "다음 중 정치·사회적인 목적을 위해 정보나 기업등의 인터넷 웹사이트를 해킹하는 행위를 무엇이라고 하는가?\n1. 핵티비즘\n2. 어나니머스\n3. 디가우징\n4. 디도스\n",
    "다음 중 인터넷서비스 제공자가 특정 콘텐츠를 데이터요금을 받지 않고 제공하는 것은?\n1. 트래픽\n2. MVNO\n3. 제로레이팅\n4. 액티브X\n",
    "유럽에서 르네상스가 가장 먼저 시작된 국가는?\n1. 네덜란드\n2. 이탈리아\n3. 영국\n4. 루마니아\n",
    "다음 중 공직자가 자신의 임기 중에 일을 무리하게 진행시키지 않고 무사안일하게 시간이 흐르기만 기다리는 현상은?\n1. 님투 현상\n2. 노비즘\n3. 핌투 현상\n4. 레임 덕\n",
    "다음 중 쿠바 혁명을 달성하고 반세기 가깝게 장기 집권하다가 2016년에 사망한 인물은?\n1. 우고 차베스\n2. 시몬 볼리바르\n3. 라울 카스트로\n4. 피델 카스트로\n",
    "다음 중 삶의 진리나 교훈 등을 간결하고 압축된 형식으로 표현한 글로 작가가 뚜렷한 것을 무엇이라 하는가?\n1. 리리시즘\n2. 아포리즘\n3. 트리비얼리즘\n4. 액조티시즘\n",
    "다음 중 국회의 동의 없이 대통령이 임명할 수 있는 공무원은?\n1. 국무총리\n2. 감사원장\n3. 헌법재판소장\n4. 경찰총장\n",
    "다음 중 특종 뉴스나 기사를 타 매체보다 앞서 독점 입수하여 먼저 보도하는 것을 무엇이라고 하는가?\n1. 엠바고\n2 딥스로트\n3. 스쿠프\n4. 오프더레코드\n",
    "김유정의 소설 중 데릴사위와 장인 간의 이야기를 익살스럽고 해학적으로 그린 농촌소설은 무엇인가?\n1. 동백꽃\n2. 소낙비\n3. 봄봄\n4. 금 따는 콩밭\n"
};
int a_dif[] = {2, 1, 3, 2, 1, 4, 2, 4, 2, 3};

char *q_nor[] = {
    "다음 중 경복궁과 관련이 없는 것은 무엇인가?\n1. 광화문\n2. 강녕전\n3. 돈화문\n4. 교태전\n",
    "근로기준법에서 여성과 관련된 내용으로 명시되어 있지 않은 것은?\n1. 생리휴가\n2. 산전,산후 휴가\n3. 갱 내 근로 금지\n4. 야간 근무 금지\n",
    "리콜제도에 대한 설명으로 틀린것은?\n1. 소비자 피해 사전 예방\n2. 피해 재발 방지\n3. 손해 배상 책임 제도\n4. 적극적 소비자 보호 제도\n",
    "우리나라의 자유무역 협정 첫 대상국은?\n1. 일본\n2. 칠레\n3. 멕시코\n4. 브라질\n",
    "우리나라 통일 정책과 가장 관련이 깊은것은?\n1. 연방제 통일\n2. 협력을 통한 점진적 통일\n3. 흡수 통일\n4. 중립화 통일\n",
    "다음 중 입체파 화가가 아닌 사람은?\n1. 반센트 반 고흐\n2. 페르낭 레제\n3. 조르주 브라크\n4. 파블로 피카소\n"
    "다음 중 표면 온도가 가장 높은 별의 색깔은?\n1.백색\n2.적색\n3. 청색\n4. 주황색\n",
    "대한민국이 남극에 두 번째로 건설한 과학기지는?\n1. 장보고 과학기지\n2. 아라온 과학기지\n3. 세종 과학기지\n4. 다산 과학기지\n",
    "다음 중 3대 시민 혁명이 아닌 것은?\n1. 프랑스 혁명\n2. 영국 혁명\n3. 신해 혁명\n4. 미국 독립 혁명\n",
    "다음 중 프랑스 국기에서 적색이 의미하는 것은 무엇인가?\n1. 평등\n2. 박애\n3. 자유\n4. 사랑\n"
};
int a_nor[] = { 3, 4, 3, 2, 2, 1, 3, 1, 3, 2};

char *q_easy[] = {
    "다음 중 태양계의 행성 지위를 박탈당한 소행성은 무엇인가?\n1. 토성\n2. 해왕성\n3. 명왕성\n4. 해왕성\n",
    "리스 산업이란?\n1. 여가 산업\n2. 기간 산업\n3. 성장 산업\n4. 시설 임대 산업\n",
    "다음 중 수익시설을 자기가 사는 지역에 유치하겠다는 지역이기주의 현상을 무엇이라 하는가?\n1. 님비 현상\n2. 바나나 현상\n3. 스프롤 현상\n4. 핌피 현상\n",
    "다음 중 보편 종교로 보기 어려운 것은?\n1. 힌두교\n2. 불교\n3. 기독교\n4. 이슬람교\n",
    "다음 중 인질이 인질범에게 동조되어 인질범을 이해하고 호감을 나타내는 현상은?\n1. 스마일 마스크 증후군\n2.스탕달 증후군\n3. 리마 증후군\n4. 스톡홀름 증후군\n",
    "우리나라 최남단에 있는 섬은?\n1. 백령도\n2. 마라도\n3. 우도\n4. 제주도\n",
    "다음 중 국제 조약이나 협약에 의해서 군대의 주둔, 무기의 배치, 군사 시설의 설치 등이 금지된 지역을 의미하는 용어는?\n1. NLL\n2. DMZ\n3. DDR\n4. JSA\n",
    "다음 중 님비 현상에 해당하지 않는 것은?\n1. 화장장 설치 반대\n2. 쓰레기매립장 설치 반대\n3. 핵폐기물처리장 설치 반대\n4. 행정수도 이전 철회 촉구\n",
    "국가가 국민의 퇴직, 질병, 사망, 장애 등으로 소득 활동이 중단되는 경우를 대비하여 전 국민을 대상으로 하여 시행하는 제도는?\n1. 고용보험\n2. 건강보험\n3. 국민연금\n4. 산재보험\n",
    "다음 중 오바마 행정부의 치적으로 평가되는 정책으로, 트펌프 대통령이 대선 공약으로 이를 폐기하겠다고 한 것은?\n1. 건강보험개혁법\n2. 전략적 인내 정책\n3. 반이민 정책\n4. 미국우선주의 정책\n"
};
int a_easy[] = {3, 4, 4, 1, 4, 2, 2, 4, 3, 1};
#endif
